app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
      @school_class = SchoolClass.find_by(id: params[:id])